AbtVtf/pager-ecosystem/firmware/sdkconfig.defaults
# PagerOS default sdkconfig.
#
# Source of truth for chip + flash + PSRAM + partition wiring.
# Per-developer overrides live in `sdkconfig` (gitignored); never commit a baked sdkconfig.

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# --- Flash (16 MB) ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- PSRAM (8 MB Quad on T-LoRa Pager) ---
# The board ships an ESP32-S3 with 8 MB QSPI (quad) PSRAM, not OPI/octal.
# Empirically verified on /dev/ttyACM0: octal mode reports
# `octal_psram: PSRAM ID read error: 0x00000000` (PAG-121); quad mode reports
# `esp_psram: Found 8MB PSRAM device` and passes the self-test r/w probe.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# FW-002: don't panic at PSRAM init — let bootloader self-test detect and
# hard-fail with a structured log, per SPEC §7.2 boot flow.
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# --- Partition table (custom, see partitions.csv) ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# --- OTA / rollback ---
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_FACTORY_RESET=n

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# --- Console (USB-CDC for /dev/ttyACM0 device link) ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000

# --- TLS (FW-009 Wi-Fi + HTTPS) ---
# Attach ESP-IDF's bundled Mozilla CA roots so esp_http_client validates
# every public App Server certificate without per-cert pinning. The
# FULL bundle covers all Mozilla NSS roots (~63 KB ROM hit) which is
# the right default since PagerOS apps can be hosted anywhere.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
